
Процедура ОСМИ_ВыполнениеОтложенныхДействий() Экспорт
	
	СистемаВключена = ПолучитьФункциональнуюОпцию("ОСМИ_ПодсистемаВключена");
	Если НЕ СистемаВключена Тогда
		Возврат;
	КонецЕсли;
	// Вставить содержимое обработчика.
	
КонецПроцедуры

Процедура ОСМИ_РегламентноеЗадание(Настройка) Экспорт
	
	СистемаВключена = ПолучитьФункциональнуюОпцию("ОСМИ_ПодсистемаВключена");
	Если НЕ СистемаВключена Тогда
		Возврат;
	КонецЕсли;
	
	Настройка.НастройкаСобытия.ПолучитьОбъект().ОтработатьСобытие("РегламентноеЗадание");	

КонецПроцедуры

Процедура ПроверитьШаблоныКарт() Экспорт
	
	СистемаВключена = ПолучитьФункциональнуюОпцию("ОСМИ_ПодсистемаВключена");
	Если НЕ СистемаВключена Тогда
		Возврат;
	КонецЕсли;
	
	СписокОшибок = ОСМИ_ОбщиеСервер.ПроверитьСоответствиеПолейШаблоновКарт();
	
	Для Каждого стр Из СписокОшибок Цикл
		ЗаписьЖурналаРегистрации(
		"ОСМИ.Проверка шаблонов",
		УровеньЖурналаРегистрации.Предупреждение,
		,
		,стр.Ошибка);
	КонецЦикла;
	
	Если СписокОшибок.Количество() > 0 Тогда
		ОтправитьПисьмоОбОшибке(СписокОшибок);
		Константы.ОСМИ_ПодсистемаВключена.Установить(Ложь);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтправитьПисьмоОбОшибке(мОшибок)
	
	МодульРаботыСЭлектроннойПочтой = Метаданные.ОбщиеМодули.Найти("РаботаСПочтовымиСообщениями");
	Если МодульРаботыСЭлектроннойПочтой = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		
		Кому = Константы.ОСМИ_EmailАдминистратора.Получить();
		Если Кому = "" Тогда
			Возврат;
		КонецЕсли;
		
		БлокОшибок = "";
		Для Каждого Ош Из мОшибок Цикл
			БлокОшибок = БлокОшибок + ?(БлокОшибок = "", "", Символы.ПС) + Ош.Ошибка;
		КонецЦикла;
		
		УчЗапись = МодульРаботыСЭлектроннойПочтой.СистемнаяУчетнаяЗапись();
		
		ПараметрыСообщения = Новый Структура;
		ПараметрыСообщения.Вставить("Кому", Кому);
		ПараметрыСообщения.Вставить("Тема", "Ошибка в шаблонах ОСМИ");
		ПараметрыСообщения.Вставить("Тело", "При автоматической проверке шаблонов карт обнаружено рассогласование в данных на сервере ОСМИ и 1С:"
											+ Символы.ПС + Символы.ПС + БлокОшибок + Символы.ПС + Символы.ПС +
											"Подсистема ОСМИ отключена.
											 |Исправте шаблоны и включите подсистему ОСМИ.");
	
		МодульРаботыСЭлектроннойПочтой.ОтправитьПочтовоеСообщение(УчЗапись, ПараметрыСообщения); 
	
	Исключение
	КонецПопытки;
	
КонецПроцедуры
