
Функция Event(Event, Serial)
	
	СистемаВключена = ПолучитьФункциональнуюОпцию("ОСМИ_ПодсистемаВключена");
	Если НЕ СистемаВключена Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ОтветТип = ФабрикаXDTO.Тип("http://localhost/request", "Response");		
	Ответ = ФабрикаXDTO.Создать(ОтветТип);
	
	СН = СокрЛП(Serial); 
	Событие = СокрЛП(Event);
	
	ЗаписьЖурналаРегистрации("ОСМИ.WS",УровеньЖурналаРегистрации.Информация,,,"" + Событие +  " " + СН);
	
	Успех = истина;              
	Ошибка ="OK";     	
	
	Если не ПроверитьСтроку(СН,"[a-zA-Z0-9]{1,20}") Тогда 
		Успех = ложь;
		Ошибка ="Invalid serial number";					
	ИначеЕсли Событие = "cardupdate" Тогда //Содержимое карты изменилось 
		Успех = ложь;
		Ошибка ="No handler for this event";				
	ИначеЕсли Событие = "cardautocreate" Тогда //Клиент скачал новую карту через кампанию
		Успех = ложь;
		Ошибка ="No handler for this event";					
	ИначеЕсли Событие = "userregister" Тогда //Клиент прошел регистрацию - грузим рег данные по серийному номеру
		Успех = ложь;
		Ошибка ="No handler for this event";					
	ИначеЕсли Событие = "cardactive" Тогда //Пользователь установил карту на телефон или разрешил автообновление
		Успех = ложь;
		Ошибка ="No handler for this event";	
	ИначеЕсли Событие = "cardinactive" Тогда //Пользователь удалил карту с телефона или запретил автообновление
		Успех = ложь;
		Ошибка ="No handler for this event";	
	ИначеЕсли Событие = "carddownload" Тогда //Телефон загрузил обновленную карту (получил ПУШ)
		Успех = ложь;
		Ошибка ="No handler for this event";	
	Иначе
		Успех = ложь;
		Ошибка = "Unknown event type";		
	КонецЕсли;
	

	ЗаписьЖурналаРегистрации("ОСМИ.WS",УровеньЖурналаРегистрации.Информация,,,"" + Успех +  " " + Ошибка);
		
	Ответ.Succes = Успех;
	Ответ.ErrorMessage = Ошибка;
	
	возврат Ответ;	
КонецФункции

Функция ПроверитьСтроку(Строка, Фасет)
	Чтение = Новый ЧтениеXML;
	Чтение.УстановитьСтроку(
	"<Model xmlns=""http://v8.1c.ru/8.1/xdto"" xmlns:xs=""http://www.w3.org/2001/XMLSchema"" xmlns:xsi=""http://www.w3.org/2001/XMLSchema-instance"" xsi:type=""Model"">
	|<package targetNamespace=""sample-my-package"">
	|<valueType name=""testtypes"" base=""xs:string"">
	|<pattern>" + Фасет + "</pattern>
	|</valueType>
	|<objectType name=""TestObj"">
	|<property xmlns:d4p1=""sample-my-package"" name=""TestItem"" type=""d4p1:testtypes""/>
	|</objectType>
	|</package>
	|</Model>");
	
	Модель = ФабрикаXDTO.ПрочитатьXML(Чтение);
	МояФабрикаXDTO = Новый ФабрикаXDTO(Модель);
	Пакет = МояФабрикаXDTO.Пакеты.Получить("sample-my-package");
	Тест = МояФабрикаXDTO.Создать(Пакет.Получить("TestObj"));

    Попытка
        Тест.TestItem = Строка;
        Возврат Истина
    Исключение
        Возврат Ложь
    КонецПопытки;
    
КонецФункции