&НаСервере
Процедура ОбновитьКартуНаСервере()
	
	Об = РеквизитФормыВЗначение("Объект");
	Об.УстановитьЗначенияПолей();
	
	Карта = ОСМИ_РаботаСAPI.ЗапроситьИнформациюПокарте(Об.Код);
	
	Об.ПоляКарты.Очистить();
	
	Если Карта.Успех Тогда
		
		Для Каждого Значение  из Карта.Ответ.values Цикл
			Стр = Об.ПоляКарты.Добавить();
			Стр.Поле = Значение.label;
			Стр.Значение = Значение.value; 
		КонецЦикла;
		
		Модифицированность = Истина;
		
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(об,"Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКарту(Команда)
	
	Если Модифицированность Тогда
		ПоказатьПредупреждение(, "Электронную карту необходимо сначала записать!");
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Шаблон) Тогда
		ОбновитьКартуНаСервере();
	Иначе
		ПоказатьПредупреждение(,"Не выбран шаблон!");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеВидимостьюДоступностью();
	
	Баркод = ОСМИ_ОбщиеСервер.ПолучитьБаркодДляЭлектроннойКарты(Объект.Ссылка);
	Карта = ОСМИ_ОбщиеСервер.Получить1СКарту(Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ШаблонПриИзмененииНаСервере()
	
	Объект.ОтображатьБаркод = Объект.Шаблон.ОтображатьБаркод;
	Объект.ОтображатьПодпись = Объект.Шаблон.ОтображатьПодпись;
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонПриИзменении(Элемент)
	
	ШаблонПриИзмененииНаСервере();
	УправлениеВидимостьюДоступностью();
	
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостьюДоступностью()
	
	Если НЕ ЗначениеЗаполнено(Объект.Шаблон) Тогда
		Элементы.ГруппаБаркод.Видимость = Ложь;
	Иначе
		Элементы.ГруппаБаркод.Видимость = Истина;
		Элементы.Баркод.Видимость = Объект.Шаблон.ОтображатьБаркод ИЛИ Объект.Шаблон.ОтображатьПодпись;
		Элементы.ОтображатьБаркод.Видимость = Истина;
		Элементы.ОтображатьПодпись.Видимость = Истина;
		Элементы.ОтображатьБаркод.Доступность = Объект.Шаблон.ОтображатьБаркод;
		Элементы.ОтображатьПодпись.Доступность = Объект.Шаблон.ОтображатьПодпись;
	КонецЕсли;
		
КонецПроцедуры
