
&НаКлиенте
Процедура Подбор(Команда)
	
	сПараметры = Новый Структура("МножественныйВыбор", Истина);
	
	ОткрытьФорму(ПолучитьФормуПодбора(), сПараметры,,,,,Новый ОписаниеОповещения("ОбработкаПодбора", ЭтотОбъект));
	
КонецПроцедуры

&НаСервере
Функция ПолучитьФормуПодбора()
	Возврат ""+ 
	Метаданные.НайтиПоТипу(ТипЗнч(РеквизитФормыВЗначение("Объект").Адресаты.Добавить().Карта)).ПолноеИмя() 
	+ ".ФормаВыбора"
КонецФункции

&НаКлиенте
Процедура ОбработкаПодбора(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение <> Неопределено Тогда
		Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") тогда
			Для каждого мас Из ВыбранноеЗначение Цикл
				Стр = Объект.Адресаты.Добавить();
				Стр.Карта = мас;
			КонецЦикла;
		Иначе
			Стр = Объект.Адресаты.Добавить();
			Стр.Карта = ВыбранноеЗначение;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКарты(Команда)
	
	ОткрытьФорму("Обработка.ОСМИ_ЗагрузкаАдресатов.Форма.Форма", , ЭтаФорма, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Обработка.ОСМИ_ЗагрузкаАдресатов.Форма.Форма" Тогда
		ЗагрузитьКартыИзОбработкиНаСервере(ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗагрузитьКартыИзОбработкиНаСервере(Данные)
	
	тзКарты = ПолучитьИзВременногоХранилища(Данные.АдресВХранилище);
	
	Для Каждого стр Из тзКарты Цикл
		
		Если стр.Карта.Пустая() Тогда
			Продолжить;
		КонецЕсли;
		
		НовСтр = Объект.Адресаты.Добавить();
		НовСтр.Карта = стр.Карта;
		
	КонецЦикла;
	
КонецПроцедуры
