Процедура ПриДобавленииОбработчиковУстановкиПараметровСеанса(Обработчики) Экспорт
	
	Обработчики.Вставить("ОСМИ_КэшПараметровHTTPSАвторизации_cnonce",
		"ОСМИ_УстановкаПараметровСеанса.УстановкаПараметровСеанса");
	Обработчики.Вставить("ОСМИ_КэшПараметровHTTPSАвторизации_nc",
		"ОСМИ_УстановкаПараметровСеанса.УстановкаПараметровСеанса");
	Обработчики.Вставить("ОСМИ_КэшПараметровHTTPSАвторизации_authorization",
		"ОСМИ_УстановкаПараметровСеанса.УстановкаПараметровСеанса");

	Обработчики.Вставить("ОСМИ_КлючИнформационнойСистемы", "ОСМИ_УстановкаПараметровСеанса.УстановкаПараметровСеанса");
	Обработчики.Вставить("ОСМИ_ТекущийКлючИнформационнойСистемы",
		"ОСМИ_УстановкаПараметровСеанса.УстановкаПараметровСеанса");

КонецПроцедуры

Процедура УстановкаПараметровСеанса(ИмяПараметра, УстановленныеПараметры) Экспорт
	
	Если ИмяПараметра = "ОСМИ_КэшПараметровHTTPSАвторизации_cnonce"
		И УстановленныеПараметры.Найти("ОСМИ_КэшПараметровHTTPSАвторизации_cnonce") = Неопределено Тогда
		ПараметрыСеанса.ОСМИ_КэшПараметровHTTPSАвторизации_cnonce = "";
	КонецЕсли;
	Если ИмяПараметра = "ОСМИ_КэшПараметровHTTPSАвторизации_nc"
		И УстановленныеПараметры.Найти("ОСМИ_КэшПараметровHTTPSАвторизации_nc") = Неопределено Тогда
		ПараметрыСеанса.ОСМИ_КэшПараметровHTTPSАвторизации_nc = 1;
	КонецЕсли;
	Если ИмяПараметра = "ОСМИ_КэшПараметровHTTPSАвторизации_authorization"
		И УстановленныеПараметры.Найти("ОСМИ_КэшПараметровHTTPSАвторизации_authorization") = Неопределено Тогда
		ПараметрыСеанса.ОСМИ_КэшПараметровHTTPSАвторизации_authorization = "";
	КонецЕсли;

	Если ИмяПараметра = "ОСМИ_КлючИнформационнойСистемы"
		И УстановленныеПараметры.Найти("ОСМИ_КлючИнформационнойСистемы") = Неопределено Тогда
		ПараметрыСеанса.ОСМИ_КлючИнформационнойСистемы = Константы.ОСМИ_КлючИнформационнойСистемы.Получить();
	КонецЕсли;
	Если ИмяПараметра = "ОСМИ_ТекущийКлючИнформационнойСистемы"
		И УстановленныеПараметры.Найти("ОСМИ_ТекущийКлючИнформационнойСистемы") = Неопределено Тогда
		ПараметрыСеанса.ОСМИ_ТекущийКлючИнформационнойСистемы =
		ОСМИ_ОбщиеСервер.СформироватьКлючИнформационнойСистемы();
	КонецЕсли;
	
КонецПроцедуры
