
&НаСервере
Процедура УстановитьКартинкуНаСервере()
	
	Попытка
		НачатьТранзакцию();
		
		Зап = ОСМИ_РаботаСAPI.ДобавитьНовыйГрафическийФайл(Объект.ТипКартинки, Объект.Наименование, Объект.ДанныеКартинки);
		
		Если Зап.Успех Тогда
			Объект.Код = Зап.Ответ.general.imgId;
			Записать();
			ЗафиксироватьТранзакцию();
		Иначе
			ВызватьИсключение "не удалось сохранить картинку на сервере";
		КонецЕсли;
	Исключение
		ЗаписьЖурналаРегистрации("ОСМИ.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, "Не удалось записать картинку");
		Сообщить(ОписаниеОшибки());
		ОтменитьТранзакцию();
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКартинку(Команда)
	
	Если Объект.ТипКартинки.Пустая() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не выбран тип картинки";
		Сообщение.Поле = "Объект.ТипКартинки";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
    ДополнительныеПараметры = Новый Структура;
    ДополнительныеПараметры.Вставить("ВыборЗавершение", Новый ОписаниеОповещения("ВложениеВыборЗавершение", ЭтотОбъект));
    Оповещение = Новый ОписаниеОповещения("НачатьПодключениеРасширенияРаботыСФайламиЗавершение", ЭтотОбъект, ДополнительныеПараметры);
    НачатьПодключениеРасширенияРаботыСФайлами(Оповещение);	
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьПодключениеРасширенияРаботыСФайламиЗавершение(Подключено, ДополнительныеПараметры) Экспорт
    
    Если Не Подключено Тогда
        Оповещение = Новый ОписаниеОповещения("НачатьУстановкуРасширенияРаботыСФайламиЗавершение", ЭтотОбъект, ДополнительныеПараметры);
        ТекстСообщения = НСтр("ru='Для продолжении работы необходимо установить расширение для веб-клиента ""1С:Предприятие"". Установить?'");
        ПоказатьВопрос(Оповещение, ТекстСообщения, РежимДиалогаВопрос.ДаНет); 
	Иначе
        ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ВыборЗавершение, Истина);
    КонецЕсли;
    
КонецПроцедуры

&НаКлиенте
Процедура НачатьУстановкуРасширенияРаботыСФайламиЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    Если Результат = КодВозвратаДиалога.Да Тогда
        НачатьУстановкуРасширенияРаботыСФайлами(ДополнительныеПараметры.ВыборЗавершение);
    КонецЕсли;
    
КонецПроцедуры

&НаКлиенте
Процедура ВложениеВыборЗавершение(ДополнительныеПараметры, Результат) Экспорт
	
	ДиалогВФ = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВФ.Расширение = "png";
	ДиалогВФ.МножественныйВыбор = Ложь;
	ДиалогВФ.Показать(Новый ОписаниеОповещения("УстановитьКартинкуЗавершение", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКартинкуЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если (ВыбранныеФайлы <> Неопределено) Тогда
		
		МассивФайлов = ВыбранныеФайлы;
		Для Каждого ИмяФайла Из МассивФайлов Цикл
			Оповещение = Новый ОписаниеОповещения("СозданиеДвоичныхДанныхЗавершение", ЭтотОбъект);
			НачатьСозданиеДвоичныхДанныхИзФайла(Оповещение, ИмяФайла);
		КонецЦикла;
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура СозданиеДвоичныхДанныхЗавершение(ДД, ДополнительныеПараметры) Экспорт

	Объект.ДанныеКартинки = Base64Строка(ДД);
	Предосмотр = "		
			|<html>
			|<body>
			|<img src=""data:img/png;base64," + Объект.ДанныеКартинки +  """ />
			|</body>
			|</html>";
			
	УстановитьКартинкуНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.ДанныеКартинки <> "" Тогда
		
		Предосмотр = "		
			|<html>
			|<body>
			|<img src=""data:img/png;base64," + Объект.ДанныеКартинки +  """ />
			|</body>
			|</html>";
			
	КонецЕсли;
	
КонецПроцедуры