
&НаСервере
Процедура ПроверитьНаСервере()
	
	ТЗ = РеквизитФормыВЗначение("Карты");
	ОтчетОб = РеквизитФормыВЗначение("Отчет");
	
	Доставки = ОтчетОб.ПолучитьСтатусыДоставки(Тз.ВыгрузитьКолонку(0),ДатаОтправки);
	
	Тз.Очистить();
	Доставлено = 0;
	Для Каждого Стр из Доставки Цикл
		СтрН = Тз.Добавить();
		ЗаполнитьЗначенияСвойств(СтрН,Стр);
		Если Стр.СтатусДоставки Тогда
			Доставлено = Доставлено + 1;
		КонецЕсли;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ТЗ,"Карты");
	
	Отправлено = ТЗ.Количество();
	Если Отправлено > 0 Тогда
		ПроцентДоставки = 100 * Доставлено / Отправлено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Проверить(Команда)
	ПроверитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КартыКарта1СПриИзменении(Элемент)
	Строка = ЭтаФорма.Элементы.Карты.ТекущиеДанные;
	Строка.Карта = ОСМИ_ОбщиеСервер.ПолучитьЭлектроннуюКарту(Строка.Карта1С);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Параметры.Источник) Тогда
		ДатаОтправки = ?(ЗначениеЗаполнено(Параметры.Источник.ДатаОтправки),Параметры.Источник.ДатаОтправки,Параметры.Источник.Дата);
		Для Каждого СТр из Параметры.Источник.Адресаты Цикл
			Стрн = Карты.Добавить();
			СтрН.Карта1С = Стр.Карта;
			СтрН.Карта = ОСМИ_ОбщиеСервер.ПолучитьЭлектроннуюКарту(СтрН.Карта1С)
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЗначениеЗаполнено(Параметры.Источник) Тогда
		ПроверитьНаСервере();	
	КонецЕсли;
КонецПроцедуры
