
Процедура ПроведениеДокументовОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	СистемаВключена = ПолучитьФункциональнуюОпцию("ОСМИ_ПодсистемаВключена");
	Если НЕ СистемаВключена Тогда
		Возврат;
	КонецЕсли;       
	
	Если Источник.ДополнительныеСвойства.Свойство("ОСМИ_НеОбновлять") Тогда
		Если Источник.ДополнительныеСвойства.ОСМИ_НеОбновлять Тогда 
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	НастройкиСобытий.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.ОСМИ_НастройкиСобытий КАК НастройкиСобытий
	                      |ГДЕ
	                      |	НастройкиСобытий.ОбъектКонфигурации = &ОбъектКонфигурации
	                      |	И НастройкиСобытий.Использование");

	Запрос.УстановитьПараметр("ОбъектКонфигурации", Метаданные.НайтиПоТипу(ТипЗнч(Источник.Ссылка)).ПолноеИмя());
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Выборка.Ссылка.ПолучитьОбъект().ОтработатьСобытие(Источник.Ссылка);	
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

Процедура ЗаписьСправочникаПриЗаписи(Источник, Отказ) Экспорт
	
	СистемаВключена = ПолучитьФункциональнуюОпцию("ОСМИ_ПодсистемаВключена");
	Если НЕ СистемаВключена Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	НастройкиСобытий.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.ОСМИ_НастройкиСобытий КАК НастройкиСобытий
	                      |ГДЕ
	                      |	НастройкиСобытий.ОбъектКонфигурации = &ОбъектКонфигурации
	                      |	И НастройкиСобытий.Использование");

	Запрос.УстановитьПараметр("ОбъектКонфигурации", Метаданные.НайтиПоТипу(ТипЗнч(Источник.Ссылка)).ПолноеИмя());
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Выборка.Ссылка.ПолучитьОбъект().ОтработатьСобытие(Источник);	
	КонецЦикла;	
	
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры
