Функция ПолучитьСтатусыДоставки(МассивКарт, Дата = Неопределено) Экспорт 
	СписокНаПроверку = МассивКарт;
	Если Дата = Неопределено Тогда 
		Дата = НачалоДня(ТекущаяДата()); 
	КонецЕсли;
	
	// todo - перенести это в фон
	
	Доставки = ОСМИ_РаботаСAPI.ПолучитьСтатусДоставкиПушСообщения(Дата);	
	
	Если Доставки.Успех Тогда
		Рег = РегистрыСведений.ОСМИ_ДатыОбновлений.СоздатьНаборЗаписей();
		Для Каждого Карта из Доставки.Ответ.delivery Цикл
			Справ = Справочники.ОСМИ_ЭлектронныеКарты.НайтиПоКоду(Карта.serialNo); 
			
			Если не Справ = Справочники.ОСМИ_ЭлектронныеКарты.ПустаяСсылка() Тогда
				Стр = рег.Добавить();
				Стр.Карта = Справочники.ОСМИ_ЭлектронныеКарты.НайтиПоКоду(Карта.serialNo);
				Стр.ПоследнееОбновление = Карта.delivered;
				Стр.Активность = Истина;
			КонецЕсли;
		КонецЦикла;
		Рег.Записать(Истина);
	КонецЕсли;
	
	
	Запрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Ссылка КАК Карта,
	|	ОСМИ_ДатыОбновлений.ПоследнееОбновление КАК ДатаДоставки,
	|	ВЫБОР
	|		КОГДА ОСМИ_ДатыОбновлений.ПоследнееОбновление ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ОСМИ_ДатыОбновлений.ПоследнееОбновление > &Дата
	|	КОНЕЦ КАК СтатусДоставки,
	|	ОСМИ_СоответствиеКарт.ОбъектБазы КАК Карта1С
	|ИЗ
	|	(ВЫБРАТЬ
	|		ОСМИ_ЭлектронныеКарты.Ссылка КАК Ссылка
	|	ИЗ
	|		Справочник.ОСМИ_ЭлектронныеКарты КАК ОСМИ_ЭлектронныеКарты
	|	ГДЕ
	|		ОСМИ_ЭлектронныеКарты.Ссылка В(&МассивКарт)) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОСМИ_ДатыОбновлений КАК ОСМИ_ДатыОбновлений
	|		ПО ВложенныйЗапрос.Ссылка = ОСМИ_ДатыОбновлений.Карта
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОСМИ_СоответствиеКарт КАК ОСМИ_СоответствиеКарт
	|		ПО ВложенныйЗапрос.Ссылка = ОСМИ_СоответствиеКарт.ЭлектроннаяКарта";
	Запрос.УстановитьПараметр("МассивКарт",МассивКарт);
	Запрос.УстановитьПараметр("Дата",Дата);
	Выб = ЗАпрос.Выполнить().Выгрузить();
			
	Возврат Выб;
	
КонецФункции


	
	