функция ПолучитьСтрокуПредосмотра() Экспорт
	Если ЗначениеЗаполнено(ДанныеКартинки) Тогда 
		возврат	"		
			|<html>
			|<body>
			|<img src=""data:img/png;base64,"+ДанныеКартинки +  """ />
			|</body>
			|</html>";
	Иначе
		
		Картинка = ОСМИ_РаботаСAPI.ЗапроситьИнформациюОГрафическомФайлеИзБиблиотеки(Код);
		Если Картинка.Успех Тогда
			ДанныеКартинки = Картинка.ответ.imgData; 
			Записать();
			возврат	"		
			|<html>
			|<body>
			|<img src=""data:img/png;base64,"+ДанныеКартинки +  """ />
			|</body>
			|</html>"
			
			
			//"<img src=""data:img/png;base64," + ДанныеКартинки+ """ />";
		КонецЕсли;
	КонецЕсли;	
КонецФункции