
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Карты1С = Адресаты.ВыгрузитьКолонку("Карта");
	
	КартыОСМИ = Новый Массив;
	
	Для Каждого Карта Из Карты1С Цикл
		КартаОСМИ = ОСМИ_ОбщиеСервер.ПолучитьЭлектроннуюКарту(Карта); 
		Если не КартаОСМИ = Неопределено Тогда
			КартыОСМИ.Добавить(КартаОСМИ.Код);
		КонецЕсли;
	КонецЦикла;

	ОСМИ_РаботаСAPI.ОтправитьДинамическуюАкцию(
	Ложь,
	КартыОСМИ,
	,
	ДатаОтправки,
	ДатаЗавершения,
	ТекстЗаголовка,
	ТекстАкции,
	ТекстСообщения,
	Картинка.Код,
	ЦветЗаголовка,
	ЦветТекста,
	ЦветФона
	);

КонецПроцедуры
